{"business_id":"cdk-qqJ71q6P7TJTww_DSA","cool":0,"date":"2013-06-30","funny":0,"review_id":"j-yH9jC5b_jd97eQpUPuhA","stars":3,"text":"Not a bad remodeled hotel.\nMy girlfriend found some online deal for this place, so we went there.\nThe rooms were pretty standard, the location was ok, right downtown, but too close to homeless people strolling by throughout the day and night.\nThe backyard is off limits, it is full of garbage.","type":"review","useful":0,"user_id":"-9SoHrhiiUVmx6-MkyR4RA"}
{"business_id":"cdk-qqJ71q6P7TJTww_DSA","cool":0,"date":"2012-12-08","funny":0,"review_id":"BGGGvxWeMuLcCj2B4iig6Q","stars":3,"text":"This is a recently opened hotel.  Judging by the layout of the building and its location in the city, I think it may have once been a residence.\n\nDon't let that scare you.  The place has been renovated top to bottom.  Brand. New Everything.  \n\nVery Decent Rates and Rooms mean it's good choice right now.   I'd definitely go back.\n\nFWIW, I conducted a thorough bedbug check and didn't see anything suspect.","type":"review","useful":1,"user_id":"AQ7ngJEEsAfLWAYarI0dhA"}
{"business_id":"cdk-qqJ71q6P7TJTww_DSA","cool":0,"date":"2015-11-29","funny":0,"review_id":"tQysCIGKX3g5QPtIeeuvSA","stars":1,"text":"Do not stay here.\n\nWhen you walk in, you will probably be impressed with the modern lobby. Security seems good for such a sketchy area, and the tiny rooms are acceptably clean. And hey, there's breakfast included too!\n\nWhat you will not learn until the wee hours is that the security that keeps the riffraff out also keeps the riffraff in. This place is overflow from the Inglewood (and others). Once the security doors close on your floor, front desk cannot hear what is going on. But you will be able to. Paper thin walls will keep you up until the crack of dawn. Also, don't even bother calling the front desk. Usually it's a solitary staff member, completely unequipped to handle the ruckus/parties/etc. Call the police instead, because the staff won't do a thing.\n\nWorst stay ever.","type":"review","useful":0,"user_id":"CSyVOWq1i6unqVIF6yv6QA"}
{"business_id":"cdk-qqJ71q6P7TJTww_DSA","cool":0,"date":"2014-08-31","funny":0,"review_id":"5vfjdRURAif8DbPU2o6IUA","stars":4,"text":"Booked the Comfort inn for labour day weekend so the prices were fairly high across the city.  The room was quite nice which was a bit unexpected.  An old building it seems to have been updated in recent years.  Everything was clean and modern.  There was a fridge and microwave in the room and a small kitchenette with a sink as well as a table and two chairs.  Beds and pillows were comfortable.  The breakfast was what you would expect from a continental breakfast.  There were eggs and sausages as well as pancakes which was nice.  I would definitively return if in the area again.","type":"review","useful":0,"user_id":"0l3x4EgoWVYdla3CPpAKag"}
{"business_id":"cdk-qqJ71q6P7TJTww_DSA","cool":0,"date":"2015-03-01","funny":0,"review_id":"QSftxVxeF_PenhB9ndQOEw","stars":3,"text":"Always enjoy staying at this hotel but seems to always have a handicap room.  The room had no working heat for the first 8 hours after check-in and the tub was not level so it never drained.  The front desk did apologize and bring more blankets and a space heater.","type":"review","useful":0,"user_id":"ObBjCIJn23tWF1Rz1Lseig"}
{"business_id":"cdk-qqJ71q6P7TJTww_DSA","cool":0,"date":"2013-04-02","funny":0,"review_id":"UvP_wQjrohYaE7TUVCiQ-Q","stars":3,"text":"Staff is amazing, rooms are compact, no pool. Ice on lower floor only but steps from Tim Hortons and fabulous park around the corner.  Streetcar can be caught just up block but subway station is four locks away. Convenience store across street is well stocked but pricey.  Ideal location for downtown stay but the budget minded.  If you go, do NOT miss the Loblaws in Maple Leaf Gardens. Take out section is amazing!","type":"review","useful":0,"user_id":"Rdfmaec2thHq7oZqbHg7cQ"}
{"business_id":"cdk-qqJ71q6P7TJTww_DSA","cool":0,"date":"2014-06-27","funny":0,"review_id":"BAtxh2r4VngJ4RXLSIlZWQ","stars":3,"text":"Stayed for 4 days with the family. No pool. Wifi was free. Breakfast is adequate and incl waffles, but the seating area is too small. Rooms are very compact - 1 foot btwn beds and dresser. But clean. Fitness area has only one elliptical and one treadmill - ok I guess. Overall adequate but nothing special.","type":"review","useful":1,"user_id":"d1LU2oIXZ3QaU5fZ3Jp2HQ"}
{"business_id":"cdk-qqJ71q6P7TJTww_DSA","cool":0,"date":"2016-05-15","funny":0,"review_id":"u1HWRi-AxbyeDFZWRzBwVA","stars":2,"text":"I really wanted to like this hotel, but I didn't get a single night of good sleep here. The beds are comfortable and the shades are dark, two great pluses. However, the A/C units were poor in a number of rooms our group stayed in and took days to cool down the rooms. The location was good, short walking distance to city center, and it wasn't too much work to get there. We took the Pearson Express train to the train station, then the subway to the closest stop, then still had a few blocks to walk. The elevator in this building is horrifying. I swear it took 5 solid minutes for it to get to the 4th floor where my room was. The downsides were the noise. Poor insulation inside, so you could hear every door opening and closing on your floor. I got woken up each day at 4-4:30 with birds sitting on the ledge outside my window and tapping on the window/cooing/etc. You could scare them away, but they just came back, time and time again. Unfortunately not a restful night to be had.","type":"review","useful":0,"user_id":"pxgXiW6BjsbYYe6nUPphjw"}
{"business_id":"LTlCaCGZE14GuaUXUGbamg","cool":0,"date":"2016-09-06","funny":0,"review_id":"A8qfpn5a5nPcIuE2675fQw","stars":5,"text":"There aren't enough good things to say about the team at Cut and Taste. We hosted a summer dinner party and all of the guests raved about how good the food and the service was. Jeremy and the guys created the menu for us and everything was so so good. The service was beyond expectations, all of our guests felt pampered. This is the second event Cut and Taste has done for us and people are still talking about the food at our first party 2 years ago. Highly recommend Jeremy, Adam, Alex and the whole team.","type":"review","useful":0,"user_id":"OELlLQMDC3xk0hw5ddiEiA"}
{"business_id":"LTlCaCGZE14GuaUXUGbamg","cool":0,"date":"2014-05-20","funny":0,"review_id":"X1SXw2-MFA9rdLVg2UBV_Q","stars":5,"text":"Cut & Taste caters lunches at World Market Center and a number of other downtown Las Vegas businesses. The owners - Jeremy, Adam, and Alex - have saved us on many occasions by providing excellent, healthy, and fresh food to last minute gatherings/meetings. They are very easy to work with and provide creative ideas for menu items. They take boring food and give it a modern twist, make it fun. At our most recent meeting, the BLT (with jalapeno bacon) and the Cajun shrimp lettuce wraps received raving reviews.","type":"review","useful":2,"user_id":"lNJaqRXRpHuOHPgPiu7qig"}
{"business_id":"LTlCaCGZE14GuaUXUGbamg","cool":1,"date":"2016-11-07","funny":0,"review_id":"7w2wpLM3qb9A2MVl2ciB8g","stars":5,"text":"Cut and Taste is phenomenal.  They catered our wedding and the experience was excellent from start to finish.  We weren't even sure what kind of food we wanted, but Jeremy from C+T worked with us and constructed a menu that was impressive, delicious, and upscale.  After the wedding, I had multiple guests tell me it was the best food they'd ever had at a wedding.  EVER.  Also, the servers at the event were friendly, and attentive, and informative.  Truly impressive, I can't recommend them enough.","type":"review","useful":0,"user_id":"Nt_jTjBiwf_SzULAlBrsPg"}
{"business_id":"LTlCaCGZE14GuaUXUGbamg","cool":0,"date":"2017-01-06","funny":0,"review_id":"GQ1jLKw8VAoTr5YTEa9hFQ","stars":5,"text":"Cut and Taste is phenomenal.  They catered our wedding and the experience was excellent from start to finish.  We weren't even sure what kind of food we wanted, but Jeremy from C+T worked with us and constructed a menu that was impressive, delicious, and upscale.  After the wedding, I had multiple guests tell me it was the best food they'd ever had at a wedding.  EVER.  Also, the servers at the event were friendly, and attentive, and informative.  Truly impressive, I can't recommend them enough.","type":"review","useful":0,"user_id":"Aw_UhDd-3IDCPu9ybe12Lw"}
{"business_id":"LTlCaCGZE14GuaUXUGbamg","cool":0,"date":"2014-09-23","funny":0,"review_id":"XxxJ7_ksL1FxcAIkEPyHVA","stars":5,"text":"First Class!  Cut and Taste catered our company's ribbon cutting ceremony this week and they were phenomenal. Alex, Adam, and Jeremy were extremely professional and took full initiative to make sure everything was perfect.  It was effortless on our end; they came prepared with a vision and a plan to assure we could relax. The presentation of the food was aesthetically appealing, as well as tasty!! We will certainly be using them in the future for events, and most definitely recommending them to anyone in Las Vegas looking for exceptional caterers. These guys rock!","type":"review","useful":1,"user_id":"PlMY05d3AGDb42qarVZrXw"}
{"business_id":"LTlCaCGZE14GuaUXUGbamg","cool":0,"date":"2016-11-21","funny":0,"review_id":"TSLP7yh_laNyIsNBBu0aTw","stars":5,"text":"Cut & Taste provided the food for my Dad's 60th Birthday Party and let me tell you, it was an absolute hit! We decided on bratwurst, mac & cheese, sliders and the famous pretzel station! Everyone was RAVING about the food and the service. Alex & Jeremy are so kind, accommodating and professional. They allowed for my family to fully enjoy the party and we didn't have to worry about a thing. You guys are the BEST!","type":"review","useful":0,"user_id":"Cq0FaaEEIJgPjKbGdRTggQ"}
{"business_id":"LTlCaCGZE14GuaUXUGbamg","cool":2,"date":"2015-12-29","funny":2,"review_id":"llnSTHnXQ-qGpnUuXRf6pg","stars":5,"text":"I cannot speak highly enough of Alex and the team at Cut and Taste. They've catered our events for the last two years and we couldn't be more pleased! \n\nThey always use the highest quality ingredients and are some of the best chefs in the country. The meat is always cooked perfectly and you can taste the care and thought that is put into every dish you are served. \n\nYou can always count on Cut and Taste to be on time, professional, and friendly. If you are looking for a company for catering give Cut and Taste a shot. You definitely won't be disappointed.","type":"review","useful":3,"user_id":"XnuuGtEl7E8syck0QhjO3w"}
{"business_id":"LTlCaCGZE14GuaUXUGbamg","cool":0,"date":"2017-01-09","funny":0,"review_id":"blSnU7Ov-Zj4MwBzPeOsIg","stars":5,"text":"We hired Jeremy and his team to cater our wedding this past October, and they were perfect.  Seems a bit dramatic, but they were professional, responsive, timely, their food was utterly delectable, creative, stunningly presented (the food was the star of our wedding).  We still, months later are told that it was the most delicious food any of our guests have ever had.  We were referred to them by our incredibly talented florist, Catherine at Layers of Lovely, and we are forever grateful for it.  Between the two of them, our small and simple backyard wedding was transformed into the elegant affair that we had hoped for but didn't know how to create.  As far as pricing, well, when we received bids from two large, all inclusive catering companies, we were discouraged (for example, one bid we received for 75 guests, plated with chicken/filet of beef, cocktail hour and their bartender with THEIR well liquor came in at over $12,500....that's not a typo).  Then we met Cut and Taste and thought they had made a mistake when we received their bid.  They were around half (HALF!!!!!!!) the cost of the others.  We were able to provide all alcohol at our open bar, and Cut and Taste brought the bartender.  Honestly, our wedding would have sucked without them!  They made our day so very, very special and memorable.  I wish I could get married again so I could hire them again!  (Not really)","type":"review","useful":0,"user_id":"NZBNE3pjlJDibe_LJYr4uQ"}
{"business_id":"LTlCaCGZE14GuaUXUGbamg","cool":0,"date":"2014-09-06","funny":0,"review_id":"ooVqZTbrD_BOuOZxLm9xoQ","stars":5,"text":"We recently had their box lunches delivered to the parlor for our staff and let me tell you it was absolutely delish and fresh!! I ordered the tandoori chicken pita wrap and not one bite was disappointing! It had golden raisins, toasted almonds chicken onions and mixed greens I'm pretty picky and I could have eaten this all day! The box lunch included pita triangles fresh hummus (found it to be on the sweeter side but really enjoyed it) veggie sticks and one of the best cookies I've ever had super soft and a good mix of chocolate chunks and I want to say toffee? The delivery man was prompt and  friendly. My coworkers got pastrami, and roast beef sandwiches and also said their meals were delish we will definitely continue ordering from here. Super convenient and very fresh! Can't wait to try other menu items! Heard they change up the menu for the seasons and shop farmers market etc!","type":"review","useful":1,"user_id":"WKzh-RxI1wdZX-NufaVzew"}
{"business_id":"EDqCEAGXVGCH4FJXgqtjqg","cool":0,"date":"2013-05-23","funny":1,"review_id":"Mz0vJLJTTRwyYKQlYOEHCA","stars":1,"text":"Really cheesey! Tey deleted ONE QUARTER of the Wing It Box and NO drop in price. What gives, more coproate greed. Pop up window says this is the special price for this Restaurant! Is this chain wide?","type":"review","useful":0,"user_id":"-tHsCH0WAqDUncynPhVkKg"}
{"business_id":"EDqCEAGXVGCH4FJXgqtjqg","cool":1,"date":"2011-05-18","funny":0,"review_id":"0UfZtoPiB1x5OnsyP0KQNg","stars":3,"text":"I'm torn on this Pizza Pizza -- on the one hand, I quite enjoy the homogeneous Pizza Pizza 'za and have, over the years, ordered dozens of pies in numerous cities.  Consistently tasty, good whole wheat crust and a real tomato sauce with no crap in it (always ask for the \"Authentic Homestyle\", which is apparently known internally as \"The Good Stuff\"!)\n\nOn the other hand, unique to this particular location, their delivery can be... spotty.  Two of four times we've had pizza delivered that was, at some point during transit, juggled vertically.  This, of course, causes toppings to slide, pizza to mush, and the box top to stick to the pizza top.\n\nNothing we can't fix with a knife... but... but... is it that hard to keep your tasty pizza horizontal for the duration of its journey to our doorstep???  Figure that one out and I'll up you to ****, ya?\n\nAnyway, I know Pizza Pizza isn't the best pizza in the world but, for our location, it's consistently good (if a bit slanted!).  Factor in wide variety available and the regular deals they offer -- in particular the pizza and a movie offer, which rocks! -- and it's hard to justify ordering from anywhere else when you've got a hungry crowd.\n\nOh, and for the record, best 'za ever is as follows:\n\nWhole wheat, thin crust, four cheese blend, homestyle italian sauce, pineapple, hot banana peppers, italian sausage, chili flakes.  BLISS!","type":"review","useful":1,"user_id":"8bKpyXdiYF3ZKIB3QyEiVQ"}
{"business_id":"EDqCEAGXVGCH4FJXgqtjqg","cool":0,"date":"2014-08-24","funny":0,"review_id":"8yrO1JkClTjS8_8oCS0AQg","stars":3,"text":"Unfortunately this place keeps on pulling me back and in the recent weeks has redeemed itself through consistent customer service and completing my order spot on. With the medium box special currently going on for $4.99, you can't go wrong with this price!","type":"review","useful":0,"user_id":"lnFEQ0QNucQEd1n76J9hSg"}
{"business_id":"EDqCEAGXVGCH4FJXgqtjqg","cool":2,"date":"2014-05-30","funny":2,"review_id":"nwpS4voFjschTD8mref9Yg","stars":3,"text":"Sometimes you just have to.\n\nTheir walk in, carry out specials are always insanely cheap and currently you can order a medium three topping pizza with a free poutine for $12.99 from their app. Free poutine. \n\nI know Pizza Pizza isn't the best (it's actually the worst), but the specials are good when you're starving, cheap and craving cheese. This location is also housed in a beautiful old stone building... so that's something.","type":"review","useful":1,"user_id":"Q9mA60HnY87C1TW5kjAZ6Q"}
{"business_id":"EDqCEAGXVGCH4FJXgqtjqg","cool":0,"date":"2011-11-20","funny":0,"review_id":"z9OVb2r6AHq-5DkZITKhmg","stars":2,"text":"Why does pizza pizza not cook your pizza properly unless you specify that you want it 'well done'?  This drives me mad.  Pizza Pizza is a place where you have to ASK to have the cheese on your pizza fully melted.  That's gross.  Still, like most Ontarians, I'm pretty attached to their crummy pies.","type":"review","useful":0,"user_id":"ZPURcPXEBgGEmwe-3LqiHA"}
{"business_id":"EDqCEAGXVGCH4FJXgqtjqg","cool":3,"date":"2011-07-21","funny":3,"review_id":"PxVaHv5wuKHNm7ieeH6I2w","stars":3,"text":"Service could be a little better but if you are craving a pizza in the area, swing by here because the pizza's here are like all Pizza Pizza locations which is not a bad thing. I do like the wide selection of pre-cooked pizza's that you can order by the slice.","type":"review","useful":3,"user_id":"MbBhClrXyu8-Mk5wW5y8tg"}
{"business_id":"EDqCEAGXVGCH4FJXgqtjqg","cool":0,"date":"2012-08-28","funny":0,"review_id":"qDStvBEnpCxBQeHY-ijl1w","stars":4,"text":"When it's on your corner and the only thing serving food at 3am, you tend to become a regular. And as a regulars, you tend to bond with staff. Since the night of the free panzeroti and dipping sauce, I have worshiped the men who work here late nights. In fact, sometimes I come in here without ordering food, just to chat. You guys iz awesome.","type":"review","useful":0,"user_id":"Zk95TMXDx0zMUhYq5u8pxw"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":1,"date":"2014-04-17","funny":2,"review_id":"syCN0Ph-62tUZTLK-Z2gIQ","stars":5,"text":"Finally a quality e-cig shop without driving everywhere. Great atmosphere reasonable prices quality product and selection.","type":"review","useful":1,"user_id":"F6IBEdAVAFBCBDe9qrSwTA"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-03-29","funny":1,"review_id":"_GuozPXPqAdy9k5UBAQBgg","stars":5,"text":"This place is great! Not only can you get tons of great flavors it is awesome that it is an actual lounge where you can hang out and have a great time. You can't beat the service and prices.","type":"review","useful":0,"user_id":"cK78PTjb65kdmRL9BnEdoQ"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-03-31","funny":1,"review_id":"Dft1srk29JfGhV189-u0dQ","stars":5,"text":"There are a lot of \"Vapor Lounges\" in the area, but Innovative Vapors is the way to go ! Not only do they have the best prices, and the best selection, but they actually have a lounge and their staff is freaking awesome. If you go anywhere else, you are fooling yourself . Can't waitto go back !!!","type":"review","useful":0,"user_id":"efaUGV60LFI4v6bWPhzL-A"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-08-31","funny":0,"review_id":"us8wSijm-ow3E5JRtowapA","stars":5,"text":"This shop is awesome!  I wasn't impressed when I first visited them when it was called Innovative Vapors.  Now? I love it!","type":"review","useful":0,"user_id":"gicj23KQg8BPYetUhC0_qQ"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-12-29","funny":0,"review_id":"qx9qrh8zw97kDuZYOrBMbA","stars":5,"text":"Absolutely amazing vape shop!! Great staff, friendly, helpful, and caring. If they don't know the answer they will get the answer!! Tried tons of different juices to build my flavor profile and juices range from low to hight on quality and price. Wide variety but the amount of premium juices they carry is amazing and they are cheaper than several in house juices in the area which advertise all \"organic\". Would highly recommend everyone to get their Vaping goodies here. Batteries, mods, tanks, coils, juices, ect... A+","type":"review","useful":0,"user_id":"3o8FEgM5rb258FyW0Ye_WQ"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":1,"date":"2014-05-22","funny":3,"review_id":"-OWNUvLEMiabbqoPXaUM2w","stars":5,"text":"One of the best Vapor Shops around by far. Gorgeous storefront and staff that is actually knowledgeable. Kevin has helped me before, and truly knows his higher-level vaping stuff. Compared to some stores that seem to employ newbie vapers, I feel like I'm in company of some real vaping veterans. \n\nPrices and selection are varied and on point too. LOTS of really great and unique flavor choices. Big ups to Innovative.","type":"review","useful":1,"user_id":"wd_VhJRnEx0XLHKzXa6xSA"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-06-10","funny":0,"review_id":"Ce9O47Bu8-XQPgp-V9g4JQ","stars":5,"text":"I wanted to get a new mod and check out the juices as I have been trying to quit smoking for a number of years, but honestly, I just enjoy it too much.  Well since I got there first thing Saturday morning I was the only customer.  The gentleman who assisted me was awesome!  I had seen the Innokin VTR on your website, but the store in Tempe didn't have it so he called the Mesa location and had them hold it.  Needless to say after both places I had the Innokin VTR, an Aspire Nautilus, 4 juices and excellent information.  Since Saturday I have only smoked about 10 ciggs, I am a pack a day smoker... \n\nAbsolutely recommend this place.  Whether you are new to e-ciggs or have been around the block, they are extremely knowledgeable and truly friendly, nothing fake here.  Excellent selection!\n\nThank you Innovative Vapors!","type":"review","useful":0,"user_id":"9kUOonH4kTy3TDYyXENM6A"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-05-17","funny":0,"review_id":"mFEy9ErtWJgRKH3K9dvmqw","stars":4,"text":"I dont give out stars easily but what a great place this turned out to be. I have been looking for a store where someone would spend about 20 minutes with me and help me figure out what I am looking for. This was the place that did it. Peter was helpful and asked some questions that really nailed down what I was looking for and sold me a Kamry K101 with an Igo-W so I can explore building and dripping. They offered to teach me my first build but I was pressed for time but thats on me. They have plenty of juices to try and several different brands to choose from which I am finding is important. Store was done up nice, professional but still comfortable. This place is out of my way but worth the trip! Ill return for sure.","type":"review","useful":0,"user_id":"hPHsKqUwO_RKJNxkBOv3xQ"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-07-15","funny":0,"review_id":"KqCBkEc2BF7rHDq-NO1rqg","stars":5,"text":"Just recently visited this place from California. The best ambiance I've experienced in a while. Very laid back and friendly. I would definitely make a stop here again next time I'm in Tempe, Arizona.","type":"review","useful":0,"user_id":"nx_D0Ey9KnDdSiqaZ9gu_Q"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":1,"date":"2014-10-04","funny":0,"review_id":"lUqP0s2BBySluCgHWcXABA","stars":5,"text":"Excellent shop. Sweet lounge-esque atmosphere. Good music, pool table, trendy design. \n\nThe staff was friendly, the juice was plentiful, and they let you drip test.\n\nI needed a new o-ring for my cap and they hooked it up/put it on for me. They also hooked up some cotton (yes I know it is cheap, but not all shops would do this!) and let me use their tools to set up for my newly purchased flavors!\n\nThey also supply a line of all natural flavors.\n\n10/10 would come here again for anything vape related.","type":"review","useful":1,"user_id":"YEiJOtOBBRKEpRuvZNA9Cg"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-06-12","funny":1,"review_id":"abaKrePhd-uRq3E11FS4iQ","stars":5,"text":"I had recently written a bad review on this place because I had a bad experience with getting a replacement for a defective tank I bought from them.  I was dissatisfied with their response of no returns/exchanges.  I left my phone number and asked to be contacted by management.  \n\nI have since been contacted by the manager Andrew and he assured me they will be standing behind their products and will give me a replacement at no extra charge.  I no longer have the defective tank, but was told that it was ok in this specific stituation and that they wanted to make things right.  I want to thank Andrew for reaching out to me and correcting this situation.  \n\nIt means a lot to know that they take pride in their products and care for their customers.  You have taken my rating from 1 star to 5.  Thanks again!","type":"review","useful":0,"user_id":"QtXXRBbj3TfTzAR5d2YYVA"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-06-16","funny":0,"review_id":"N2sk0cAdi8Td3gIeMw6HPw","stars":5,"text":"My husband and I are very knowledgeable in the vaping industry. We've been to most of the shops in the phoenix metro area and lately it seems like the customer service in this industry has gone down. My friend told me about this place in tempe.  I don't give out reviews often unless it was bad service or excellent service, this shop was amazing! I had to write a review for them because they were so helpful.  Andrew and David worked with me for well over an hour to fix some problems I was having with my mod. They were both professional and very friendly! I sat at the bar for a long time tasting the juice and they did not pressure me. The Bliss line was phenomenal and this is the only shop I've found that carries that line. If you want friendly service, great pricing and the best products in a lounge atmosphere, check this place out! The only shop I will be going to from now on, even driving from Avondale.","type":"review","useful":0,"user_id":"3TvuoOVas-dCNGFCh81f6A"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-03-11","funny":1,"review_id":"9NOYdgXAyrthjilxrwVUFA","stars":5,"text":"These guys were very helpful.  We ran in to them at the Ostrich Festival in Chandler.  They told us to come in and we were not disappointed one bit.  Staff was very friendly and knowledgeable.  Not only that, they prices were lower than nearly every other shop I have been to in the area.  Not to mention, its the first Vape Lounge that is actually a lounge.  My new shop and I bet it will be yours once you check it out.","type":"review","useful":0,"user_id":"jkrzTC5P5QGJRoKECzcleQ"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-05-24","funny":1,"review_id":"j--L0VebKgrxVtduV6dZdA","stars":5,"text":"Went in and purchased my first e-cigarette! Kevin helped me out and told me everything I needed to know about my e-cig. I'm very pleased with my visit. I'm so excited about my e-cig! I got a pink one. :) thanks so much for teaching me the ways! I will be back!","type":"review","useful":0,"user_id":"naGxl2OkYoCgvhuq3d4p2Q"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-08-16","funny":0,"review_id":"QREgnZZWojUf-87cA9wfew","stars":5,"text":"Had to go in again today because I burned out a coil.  Didn't know that at the time but I talked to Kevin and he helped me out. These guys are great.","type":"review","useful":1,"user_id":"H01sSeuZ7jUGcMZjW6nggw"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-05-04","funny":1,"review_id":"dtutGbXrPwTPq5ShkvBzBA","stars":5,"text":"My wife and I had to stop by this evening bc it turns out we got a defective ecig. The guy that helped us, David (yes?), was extremely personable and helped us quickly. We were able to walk out with a new tank for the thing.\n\nIf you guys want/need to quit smoking or just find yourself wanting to smoke an ecig, this is the place to go.  Hope this place stays around.","type":"review","useful":0,"user_id":"1-eTooyYzRvnSrfwLowPgA"}
{"business_id":"0DI8Dt2PJp07XkVvIElIcQ","cool":0,"date":"2014-10-23","funny":0,"review_id":"_G8-GTjrLG4wQeF3INQHDg","stars":1,"text":"I went here one night because the shop I usually go to (Valor Vapor, who are awesome!) closes at 8pm. I went in a little after 8 to get a new cardo. Just to start off the girl had no idea what tank or cardo I was using. Then she BROKE my tank. I was not rude or loud but I was obviously upset. She said she would call her manager to see what she could do. In front of me she said to her manager on the phone that I was \"freaking out\" which I was not. I found that incredibly rude. She ended up giving me a new tank that even though was bigger was half the price of my tank that she broke. And after all of that I've been using this tank for a week and I HATE it. It sprays burning juice into my mouth and is constantly leaking. Overall I left there very upset and I'm still very upset because now I have to go buy a whole new tank again. The girl was working was completely rude and incompetent. I will never go there again and I suggest nobody else does either. I would give zero stars but I don't have that option.","type":"review","useful":0,"user_id":"e3fjKwDvt7Owq4neDDfITg"}
{"business_id":"cnGIivYRLxpF7tBVR_JwWA","cool":0,"date":"2016-07-28","funny":0,"review_id":"lCEHqw5SXxcioiIeV5PIOQ","stars":5,"text":"New to the area and had to find a new hair spot and called on a Tuesday, got an appointment with Brianna on a Thursday and she was wonderful.","type":"review","useful":0,"user_id":"-1XYK7Iw3I-CsgdCzvKlLw"}
{"business_id":"cnGIivYRLxpF7tBVR_JwWA","cool":0,"date":"2016-08-06","funny":0,"review_id":"hSCDti62aRBJu9wctXeJkA","stars":5,"text":"I started coming to Brianna over a year ago after a friend in the neighborhood recommended her.  I was newer to the area and tired of driving back to Columbus, OH just for a haircut. She has yet to disappoint and I cannot imagine she will.  Brianna is such a great stylist and always helpful.  I can honestly say she listens to everything I ask for and offers extra helpful ideas.  I love her and the salon itself is great, too.  The owner, I believe her name is Julie, is always there when I've been in and so sweet as well.  I highly suggest checking them out if you are looking for a new stylist.","type":"review","useful":0,"user_id":"-aNlGxUJNNYkDxML8pboXQ"}
{"business_id":"cnGIivYRLxpF7tBVR_JwWA","cool":0,"date":"2016-07-04","funny":0,"review_id":"BDFCs211lOig02HBD65_BQ","stars":5,"text":"Great little salon with wonderful staff! Got a spray tan and had a great experience as well as get my hair done here! Definitely recommend this place","type":"review","useful":0,"user_id":"LFXjKlmh_bzf-HenAoaKDg"}
{"business_id":"cnGIivYRLxpF7tBVR_JwWA","cool":0,"date":"2016-02-01","funny":0,"review_id":"Pj7C4vR1qkk6dh2LRVOMTg","stars":1,"text":"Day 2 post hair color my hair is dry and damaged. Does anyone have any advice for me? I want my soft long hair back. Not the dry chopped up uneven layers. If anyone out there would offer a solution is be so grateful. \n  1-30-16\nMy hair is not much better. I went to a reputable stylist. And she said. And I quote \" they fried your hair so they chopped it to hide the evidence.\" Wow !!  She's going to fix it with a simple conditioning treatment and the right cut for my hair. But my hair will take another 3-4 months to get the layers grown out again. Live and learn. \n2-1-16\nFor the record I didn't make a scene at all!!\nAnd yes sometimes I'm not happy with my hair isn't everyone. But I've never experienced this kind of attitude from a stylist after I said it was NOT what I asked for! She did yank and pull and tease my hair. I Don't appreciate being call me a liar. Make it right by teaching your stylists more about cut and color.","type":"review","useful":0,"user_id":"dyJeQm97lEZ1LgrUFp_kSA"}
